# GrossVolume Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..GrossVolume Property
Zone Class See Also
---
Get the Gross Volume of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double GrossVolume { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GrossVolume As Double
	Get
```

Visual C++
---
```text
public:
property double GrossVolume {
	double get ();
}
```

# Remarks
This property is used to get the Gross Volume of the Zone.
# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace